bit-finance/Enums/бит_ВидыАлгоритмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыАлгоритмов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусовОбъектов</Name>
					<Comment>Изменение статусов объектов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Визирование</Name>
					<Comment>Визирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ВидыАлгоритмов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДоступныеВиды = ДоступныеВидыАлгоритмов();
	Если ДоступныеВиды <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора         = ДоступныеВиды;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныеВидыАлгоритмов() Экспорт
	
	Ограничения = Новый Массив;
	Если НЕ ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(Метаданные.БизнесПроцессы.бит_Процесс) Тогда
		Ограничения.Добавить(Перечисления.бит_ВидыАлгоритмов.Прочее);
	КонецЕсли;
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ПолучатьИнформациюОтБотаТелеграм") Тогда
		Ограничения.Добавить(Перечисления.бит_ВидыАлгоритмов.Чат);
	КонецЕсли;
	
	Если Ограничения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДоступныеВиды = Новый СписокЗначений;
	Запрос        = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыАлгоритмов.Ссылка КАК ВидАлгоритма
	|ИЗ
	|	Перечисление.бит_ВидыАлгоритмов КАК ВидыАлгоритмов
	|ГДЕ
	|	НЕ ВидыАлгоритмов.Ссылка В (&Ограничения)";
	Запрос.УстановитьПараметр("Ограничения", Ограничения);
	ДоступныеВидыАлгоритма = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидАлгоритма");
	ДоступныеВиды.ЗагрузитьЗначения(ДоступныеВидыАлгоритма);
	
	Возврат ДоступныеВиды;
	
КонецФункции

#КонецОбласти

#КонецЕсли
